{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2017-07-13T01:12:03.293-07:00",
    "CommentCount": 4,
    "Custom": null,
    "Description": "\r\nI have created an automation Addin project with the NetOffice Developer Toolbox. I want to create a TaskPane. When I start the project it throws the following exception:\r\n\r\n>A project with an Output Type of Class Library cannot be started directly.\r\n>\r\n>In order to debug this project, add an executable project to this solution which references the library project. >Set the executable project as the startup project.\r\n\r\n\r\nMay someone can tell me what is necessary to start the TaskPane. \r\nI didn't change anything in the solution. (see in attachments)\r\n\r\nIt may relates to this Error:\r\n>Severity\tCode\tDescription\tProject\tFile\tLine\tSuppression State\r\nError\t\tCannot register assembly \"C:\\Users\\felix.fritschi\\Documents\\MailImport\\MailImport\\bin\\Debug\\MailImport.dll\" - access denied. Please make sure you're running the application as administrator. Access to the registry key 'HKEY_CLASSES_ROOT\\MailImport.Addin' is denied.\tMailImport\t\t\t\r\n\r\n\r\n\r\nI appreciate any help.",
    "LastUpdatedDate": "2017-07-13T01:12:03.293-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "netoffice",
    "ReportedDate": "2017-07-06T02:55:59.627-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Fixed"
    },
    "Summary": "Create Outlook TaskPane",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 22320
  },
  "FileAttachments": [
    {
      "FileId": 1669663,
      "FileName": "Screenshot (118).png",
      "DownloadUrl": ".\\1669663"
    }
  ],
  "Comments": [
    {
      "Message": "Hi felix_fri,\nthe project generated by NetOffice Developer Toolbox generates DLL assembly.\n\nIf you wish to run the project as console application, you must add Program.cs files with Main() method implementation and change the output type of the project to Console application.",
      "PostedDate": "2017-07-11T03:14:24.86-07:00",
      "Id": 208675
    },
    {
      "Message": "PS: If you want to extend MS Outlook with a TaskPane, your project type is correctly set to DLL library.\n\nYou must register the Add-in using regasm.exe so MS Outlook will load it. This may require administrative priviledges and that's why the Visual Studio is complaining about insufficient admin rights.\n\nTo debug the TaskPane, you must change the project Debug properties - set the Start external program to point to your installed MS Outlook EXE file. If the Add-in is correctly registered, you can debug the Task Pane.",
      "PostedDate": "2017-07-11T03:21:49.853-07:00",
      "Id": 208676
    },
    {
      "Message": "Hi izsak,\n\nthanks, I wanted to extend MS Outlook. And I can start it now, but my TaskPane is not shown. \n\nThe error didn't occur when I ran it as an admin.  Do I have to register it or is Visual Studio doing that for me?\n",
      "PostedDate": "2017-07-11T04:14:57.96-07:00",
      "Id": 208678
    },
    {
      "Message": "Okay I solved it. \nI  wrote the regiser and unregister methods.\nThanks anyways!",
      "PostedDate": "2017-07-12T04:19:46.103-07:00",
      "Id": 208684
    }
  ]
}