{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 3,
    "Custom": "",
    "Description": "Hi, My add-in was working fine till the upgrade .\nNow it refuses to load. I cleaned the registry and built a fresh built then looked for a reference in the vba tool and none existed, I found the reference and ticked it but it was removed again by excel.  Some other addins are also no longer loading.\nI suspect the add-in has caused some security concern and been blacklisted or something.\nDoes anyone have any advice?\n\nThanks in advance",
    "LastUpdatedDate": "2015-10-02T02:37:06.747-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "netoffice",
    "ReportedDate": "2015-09-26T11:11:33.51-07:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "excel add-n no longer loads since windows 10 upgrade",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 22027
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I need to know. your addin is:\r\n\r\n1) an addin purely based on IExtensibility2 interface2) based on COMAddin class from NetOffice tools.\r\n\r\nmoreover your current NetOffice version.\r\n\r\nPlease check also your LoadBehavior registry entry in \"Software/Microsoft/Office/Excel/Addins/$YourAddin\" (Found in HKEY_LOCAL_USER OR LOCAL_MACHINE or in Wow node on 64 bit systems)\r\n\r\nPlease check also MS-Excel didnt block the mscoree.dll in disabled items.\r\n\r\n*Sebastian",
      "PostedDate": "2015-09-28T13:56:19.59-07:00",
      "Id": 203354
    },
    {
      "Message": "Thanks Sebastian, This is revealing. I am usng a 64 bit system and the solution uses  COM adin class from Netoffice.I did not develop the cod, but this I can recognise easily. I was a develpor until 2003 and was familiar with COM, though early oud methods were more usual.I have tried to step thrugh but can;t find a way to do this form visual studio 2013 in the way I used to do with vb6 and COM early bound.\r\n\r\nCheckig the registry, I can find no reference to the addin either in the wow node  or HKEY_LOCAL_USER OR LOCAL_MACHINE.Perhaps someting is not right about how it builds?\r\n\r\nEd",
      "PostedDate": "2015-09-29T01:42:57.68-07:00",
      "Id": 203355
    },
    {
      "Message": "Still cant get it to register thought he build goes without a hitch.  any ideas anyone?",
      "PostedDate": "2015-10-02T02:37:06.747-07:00",
      "Id": 203356
    }
  ]
}