{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 1,
    "Custom": "",
    "Description": "Hi Team,\n\nI am using office power point interop to merger multiple power point document to single document. Now the issue is all document were created in office 2010 all files are merging properly if the system where it is running has office 2010. If exe runs on system having office 2013 then extra spaces get added to the slide. I amslo tried to setup page size but still he spaces get added. I googled on it and found that it is due to new slide size  added to office 2013 which is wide screen 16:9.   \n\nMy question is if I use NetOffice then can I mention which version of office to use? As we know that interop internally decides which version of component to use. It always prefer latest version. \n\nPlease answer me ASAP, any help will be appreciated. \n\nThanks,\nIndresh",
    "LastUpdatedDate": "2015-05-05T09:18:19.94-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "netoffice",
    "ReportedDate": "2015-05-02T23:59:58.813-07:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Regarding office version",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 21833
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "you can use a version specific progid to create an application instance in target version (must be installed of course). This is possible trough the interop assemblies and NetOffice. In NetOffice its a bit easier trough the application ctor like new PowerPoint.Application(\"PowerPoint.Application.14\").\r\n\r\nnext time please use the discussion board.\r\n\r\nSebastian",
      "PostedDate": "2015-05-05T09:18:19.94-07:00",
      "Id": 203294
    }
  ]
}