[
  {
    "Id": "932371",
    "ThreadId": "400781",
    "Html": "\r\n<p><span lang=\"EN-US\">Hello.</span></p>\r\n<p><span lang=\"EN-US\">I'm developing an C# application and I'd like to have some integration with the Office suite.&nbsp;</span></p>\r\n<p><span lang=\"EN-US\">But I don't know if NetOffice is my best option. Can you help me regarding that?<br>\r\n<br>\r\nThe solution is going to be used for students / teachers in the final semesters of Law School, that&nbsp;serve low income families - our customers.&nbsp;</span></p>\r\n<p><span lang=\"EN-US\">Almost all the interaction between our department and our customers are done by our interns - the Law School students.&nbsp;</span></p>\r\n<p><span><span style=\"text-decoration:underline\"><span lang=\"EN-US\">How it currently works:</span></span></span></p>\r\n<p><span lang=\"EN-US\">1.&nbsp;The students talk to our customers (low income families).&nbsp;</span></p>\r\n<p><span lang=\"EN-US\">2. If it isn&rsquo;t the customer&rsquo;s first visit, the intern queries our Access system to see the records form previous visits.\r\n</span></p>\r\n<p><span lang=\"EN-US\">3. In these talks, the students try to gather all the information and actions needed to solve our customers&rsquo; needs.</span></p>\r\n<p><span lang=\"EN-US\">4. Based on what the intern gathered so far, it has to report it. The intern opens up Word and types some basic info (like its name and its teacher) along with info about what the customer needs / what happened in the meeting.&nbsp;</span></p>\r\n<p><span lang=\"EN-US\">5. The intern prints the report and takes it to be approved by his teacher.&nbsp;<br>\r\n<br>\r\n6. Here, there are three options:<span>&nbsp;</span><br>\r\n6.1 - the report is correct and has all the info: &nbsp;the teacher approves it as it is;<br>\r\n6.2 - the report is somewhat incorrect: the teacher tells the student what to change and the next version is implicitly approved;<br>\r\n6.3 - the report is incorrect: the teacher tells &nbsp;the students what needs to be changed, and the next version needs to be explicitly approved. &nbsp;He goes back to step 3.&nbsp;<br>\r\n<br>\r\n7. When the report is approved, the intern copies the text from the Office document and pastes/add it to our internal Access system.\r\n</span></p>\r\n<p><span lang=\"EN-US\">8. The teacher saves all the reports' versions. These reports are used to evaluate the students. &nbsp;</span></p>\r\n<p><em><span lang=\"EN-US\">Problems:</span></em></p>\r\n<p><span lang=\"EN-US\">1. The approved report is not added to our internal system.\r\n</span></p>\r\n<p><span lang=\"EN-US\">2. Extreme use of paper. </span></p>\r\n<p><span style=\"text-decoration:underline\"><span lang=\"EN-US\">Solution:</span></span><span lang=\"EN-US\"> Word integration.\r\n</span></p>\r\n<p><span lang=\"EN-US\">From our internal system, when seeing the customer&rsquo;s history, place a button that would launch Word side by side with the internal application.\r\n</span></p>\r\n<p><span lang=\"EN-US\">Remove the &ldquo;Save / Save As&rdquo; command. Replace with a custom Save button. That button would send the report to the internal system.</span></p>\r\n<p><span lang=\"EN-US\">When evaluating the report, the teacher can then use Word&rsquo;s revision control to correct things and make notes.\r\n</span></p>\r\n<p><span lang=\"EN-US\">When working on the next version the student can then approve the changes.\r\n</span></p>\r\n<p><span lang=\"EN-US\">Or maybe have just a panel with Word editing features in the internal system that would allow me to enter text.\r\n</span></p>\r\n<p><span lang=\"EN-US\">Can this be accomplished with NetOffice? Or am I going to be better served using VBA? Do you have better ideas on how to proceed?</span></p>\r\n<p><span lang=\"EN-US\">Thanks in advance, for your time and support, </span></p>\r\n<p><span lang=\"EN-US\">Luiz Angelo.&nbsp;</span></p>\r\n",
    "PostedDate": "2012-10-25T06:08:08.38-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "932383",
    "ThreadId": "400781",
    "Html": "<p>you didnt read my mail answer? (send to your @live.com address)<br /><br />Sebastian</p>",
    "PostedDate": "2012-10-25T06:21:21.233-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "932503",
    "ThreadId": "400781",
    "Html": "<blockquote style=\"border: solid .1em #ccc; font-style: italic; margin: .25em 1em 0 1em; padding: 0 .25em 0 .25em;\"><strong>SebastianDotNet wrote:</strong><br />\r\n<p>you didnt read my mail answer? (send to your @live.com address)<br /> <br /> Sebastian</p>\r\n</blockquote>\r\n<p>Sorry, Sebastian.<br /><br />I read just now. I wasn't aware you had replied me. Somehow it went unnoticed.<br /><br />I'll post your answer here just for reference:</p>\r\n<pre style=\"padding-left: 30px;\">hello luiz,<br /><br />as first: embbed an office application into a windows forms application is a bad idea. i know, its nice but this way cause problems, moreover different problems on different systems. the applications doesnt works well with modal dialogs, repaint client areas and so. (typical is the office application crash if you&nbsp; forget to free the application window on the desktop while shutdown)<br /><br />i cant decide this for you but make the situation more clearly.<br />you can do all what you say with NetOffice but you can do this also with VBA, VB6, with the interop assemblies or VSTO. the code is basicly is same because all these apis offers you the COM Automation Object Model from Office/Word. VBA/VB6 is easy to use and to deploy but limited possibilities of course. if you want to use the .NET technology you have to decide you want support one or more word versions.<br />the interop assemblies works only with one specific version, since .net 4.0 you can use a feature called embed interop types in your c#/vb.net project. you need no xtra dll's and you are versionindependent in this way but you cant use events now in other words no chance to catch a click from a button or something like that. vsto exists in various version and supports office 2007 and 2010 in the last version(only with .net 4 usable as far i known but you find a helpful table on wikipedia) vsto offers some nice xtra tools/visual designers but its very hard to register/deploy and you need visual studio professional btw. NetOffice is similiar to the interop assemblies but true versionindependent and event support of course. another killer feature(i find) is the com proxy lifecyle management. if you know COM programming in .NET then you know you have to free any object with a special method. if you dont do that then the office app dont die after quit. this is much easier in NetOffice because you dont need to be free any object here. you also need not xtra registration or something like that, copy the assemblies and thats it. NetOffice has also some nice xtra tools but VSTO is better opponent here(of course, the MS VSTO team has more ressources than me) finaly, if you need to support a wide range of office versions/plattforms and you need events then NetOffice is a good way. all the other stuff in NetOffice was benefits for developers to reduce code/development time and typical problems but not true necessary. have a look on the NetOffice examples, you see the code is same as interop or vsto.<br /><br />Sebastian</pre>\r\n<p>Anyway...&nbsp;VSTO is not an option. No Professional VS for me.</p>\r\n<p>I wouldn't have to support multiple versions of Office, just Office 2010.&nbsp;<br /><br />I don't have experience in COM. I'll take a look at the examples. I just wanted to be sure that NetOffice could solve my problems and that it was the easiest solution.</p>\r\n<p>Thank you and you'll probably hear more from me down the road.</p>\r\n<p>Regards from Brazil,&nbsp;</p>\r\n<p>Luiz Angelo.&nbsp;</p>",
    "PostedDate": "2012-10-25T09:19:46.95-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]