[
  {
    "Id": "1305021",
    "ThreadId": "567512",
    "Html": "Hi,<br />\nI have previously used VSTO but would like to move to NetOffice as it looks great!<br />\nHowever I am stumped at the first hurdle, I cannot find any documentation on how to get it working with VS 2013 express.<br />\nI have downloaded the tools because it said it would setup the project but it errors in another language every time I try and start it <br />\n<blockquote>\n1 | An attempt was made to load an assembly from a network location which would have caused the assembly to be sandboxed in previous versions of the .NET Framework. This release of the .NET Framework does not enable CAS policy by default, so this load may be dangerous. If this load is not intended to sandbox the assembly, please enable the loadFromRemoteSources switch. See <a href=\"http://go.microsoft.com/fwlink/?LinkId=155569\" rel=\"nofollow\">http://go.microsoft.com/fwlink/?LinkId=155569</a> for more information. | NotSupportedException | Void .ctor()<br />\n</blockquote>\nAll I did was unzip and double click on exe, is there other things to do first?<br />\n<br />\nCheers<br />\n",
    "PostedDate": "2014-09-15T20:15:48.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1305029",
    "ThreadId": "567512",
    "Html": "Solved myself, followed the link through to the MS doc and it said the following:<br />\n<blockquote>\nIf an application has been copied from the web, it is flagged by Windows as being a web application, even if it resides on the local computer. You can change that designation by changing the file properties, or you can use the &lt;loadFromRemoteSources&gt; element to grant the assembly full trust. As an alternative, you can use the UnsafeLoadFrom method to load a local assembly that the operating system has flagged as having been loaded from the web.<br />\n</blockquote>\nSo I unblocked the zip file and extracted it again, is not erroring now.<br />\n",
    "PostedDate": "2014-09-15T21:24:37.477-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]