[
  {
    "Id": "1408942",
    "ThreadId": "625780",
    "Html": "I'm new to netoffice and a relative novice when it comes to programming (and that has mostly been vba).\r<br />\n<br />\nI have written quite a bit of vba for outlook which I wanted to share with others in the office. I could just copy the vba from machine to machine, but I decided to look into creating a proper add-in instead! (I like a challenge)\r<br />\n<br />\nI have therefore downloaded the NetOffice assemblies and #develop.\r<br />\n<br />\nI used the NetOffice Developer Tools to create the basic add-in code, using the Project Wizard with the following settings -&gt; Automation Addin, VB.NET, Visual Studio 2010 (Express), NET 4.0 (Client Profile), for Outlook, Current User, Load at Startup, only customize ribbon UI selected.\r<br />\n<br />\nLoaded the solution up in #develop and built using the default settings, and it works like a charm.\r<br />\n<br />\nAs we have multiple users I then realised that it would be better if the add-in was installed for all users. I went through the same process to create the project but selected all users instead. Built in #develop, but this fails to register the addin.\r<br />\n<br />\nI have tried manually registering the addin using c:\\windows\\microsoft.NET\\Framework\\v4.0.30319\\regasm (as administrator) which brings up a message box (generated by the addin?) of &quot;An error occured in Register&quot;, then regasm reports types registered successfully. This doesn't load in outlook.\r<br />\n<br />\nThe machine i'm running this on is 64bit windows 8, with 32bit office 2013\r<br />\n<br />\nI've tried this on a virtual machine with a fresh copy of winXP 32bit, and office 2010 with the same results - current user works fine local machine doesn't\r<br />\n<br />\nAs this is a virtually blank project, I can't understand what the problem is. Not sure if is netoffice, #develop, or the machine.  I've posted the same question on the #develop forum in case.\r<br />\n<br />\nAny help would be appreciated - Probably something obvious to someone more experienced!!\r<br />\n<br />\nRichard<br />\n",
    "PostedDate": "2015-04-13T02:56:16.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1416238",
    "ThreadId": "625780",
    "Html": "I've checked a few more things and have got it to work under all-users / local machine.\r<br />\n<br />\nIt works if I register with regasm and then manually put the registry entries under\r<br />\n<br />\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Office\\Outlook\\AddIns on the virtual machine\r<br />\n<br />\nOr\r<br />\n<br />\nHKEY_LOCAL_MACHINE\\Software\\Wow6432Node\\Microsoft\\Office\\Outlook\\AddIns\\ on my development machine with 64bit windows + 32 bit office\r<br />\n<br />\n<br />\nI've also checked using the same settings but for an excel add-in, which works fine.\r<br />\n<br />\nAny Ideas?<br />\n",
    "PostedDate": "2015-04-21T03:06:07.687-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1416789",
    "ThreadId": "625780",
    "Html": "let me know your NO version please to clearify the problem.\r<br />\n<br />\n&quot;An error occured in Register&quot; - its the default error message in NO when a problem comes up in the addin register method, most of the time its a security issue.\r<br />\nYou can modify the RegisterErrorHandler method in your addin to show more detailed informations for the error(which is helpful).\r<br />\n<br />\n*Sebastian<br />\n",
    "PostedDate": "2015-04-22T06:19:16.913-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1419020",
    "ThreadId": "625780",
    "Html": "NO version is 1.7.3\r<br />\n<br />\nI amended the RegisterErrorHandler to try to shed more light on what the error is\r<br />\nException.Message = Object reference not set to an instance of an object.\r<br />\nException.StackTrace =    at NetOffice.OutlookApi.Tools.COMAddin.RegisterFunction(Type type)\r<br />\nException.Data = System.Collections.ListDictionaryInternal\r<br />\n<br />\nI find it strange that an excel addin with the same settings works fine<br />\n",
    "PostedDate": "2015-04-27T07:30:51.717-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]